var postList = [
  {
    date: "Jan 28 2017",
    title: "小时候的冰棍儿与雪糕",
    postImg: "/images/post/post-4.jpg",
    avatar: "/images/avatar/avatar-5.png",
    content: "冰棍与雪糕绝对不是同一个东西。3到5毛钱的雪糕犹如现在的哈根达斯，而5分1毛的 冰棍儿就像现在的老冰棒。时过境迁，...",
    readingNum: 23,
    collectionNum: 3,
    commentNum: 0,
    author: "林白衣",
    dateTime: "24小时前",
    detail: "冰棍与雪糕绝对不是同一个东西。3到5毛钱的雪糕犹如现在的哈根达斯，而5分1毛的 冰棍儿就像现在的老冰棒。时过境迁，当年的老冰棍也随着童年的记忆消失不见踪影。记得小时候，每当傍晚时分，总有一个老人推着一辆小车，小车的后架上放着一个大大的白色泡沫盒子。老人一边推着车，一边叫喊着：雪糕、冰棍\n学校后面的冰淇淋店，供应几十种不同口味的冰淇淋。\n小的时侯，号称平生有两恨：\n 一恨生不能为售票员。每回坐车，最喜欢站在售票员附近，满面倾慕地望着她接过来自四面八方的钞票，用手中红蓝铅笔在黑色的票夹子当中某种车票上轻轻一划，顺手撕下划过的票根，递还到钱来的方向。从容不迫，行云流水，优雅淡定，且有大把钞票可供点数清理，更永远有座位--不论车有多挤。坐在高高座位上，偶尔向四周喊喊话的总是忙着数钱的售票员，是我童年时代对于职业女性风姿想像的巅峰。当售票员，是我首个关于未来的梦想。\n二恨我姥姥不卖冰淇淋。每当我绞尽脑汁费心机讨来的几毛几分钱交到卖冰棍的叔叔或阿姨手里边，眼巴巴地看着他从那盖着白色棉被的上面写着红色的“雪糕”“冰棍”大字样的白色木头箱子里面掏出我负担得起得那根冰棍儿的时侯，我总是不能抑制自已对于那神秘的白色木箱里我负担不起的雪糕们的憧憬与想像。这个时侯，我就无比羡慕起这位卖雪糕的叔叔阿姨的孩子来，我猜他们一定可以随便揭开那被子，掀起那箱子盖儿，看看里面的雪糕冰棍儿究竟多少种？还有多少根儿？都被码成什么样子？冰棍儿雪糕冰淇淋要是我姥姥也卖冰棍儿就好了，那样的话，我们家也会有一个这样的白色的，上面写了大大的“雪糕”“冰棍”字样的木箱，里面装满了各式各样的雪糕冰棍儿，供我吃不停。\n瞧瞧这所谓的平生两恨，就知道我从小的志趣在哪里。\n天天数钞票的愿望现如今彻底落了空。\n日日吃冰棍儿虽非力不能及，却没了那份胆魄与心力。\n 况且，现在吃的冰淇淋与小时侯吃的雪糕冰棍儿其实是两回事情。\n 小时侯最常吃的，是白色半透明的或是黄色与红色的冰棍儿。\n5分钱一根。现在想想，那味道，仿佛不过就是白水里面和些香料糖精冻成冰。夏天买了，要大口大口咬，否则不等吃完就化了。有时侯吃得急，一大块冰含在嘴里，吞也不是吐也不是，只得皱着眉头嘬着脸在原地蹦脚，不知道的人瞧着，倒仿佛是被热水给烫着了。\n白色的奶油大雪糕，一毛五一根。舔一下，便有浓浓的甜奶香裹紧舌头。雪糕可不能咬着吃，那样很快就会吃完了。要一下一下，小心翼翼地慢慢舔。舔一下，回味半天，还要跟伙伴比赛看究竟谁舔得更慢。\n奶油大雪糕涨到两毛钱一根的时侯，作为同伴，巧克力大雪糕出现了。\n 红色纸包装的巧克力，过年的时侯才有的吃，所以巧克力大雪糕的出现绝对是一个巨大的惊喜。可是浓香浓香的奶油大雪糕也不那么容易被代替的。奶油的？还是巧克力的？这大约是那时侯遇到的最严重的选择题。\n其实那时侯的雪糕冰棍儿里头，性价比最高的是小豆冰。\n 红豆冰，绿豆冰。大半截冰棍里裹了红豆绿豆，咬一口，满嘴的豆沙香。红豆绿豆其实已经煮透了，却被冻得很硬，嚼起来带劲儿又不咯牙。比冰棍儿好吃很多倍，虽不如雪糕那样松软香浓，但胜在爽口清新。\n 平常兜里最多有一毛钱，于是每每天人交战：究竟是吃两根冰棍儿还是一颗小豆冰？吃一颗小豆冰还剩三分钱，到明天，要是再有一毛钱，就可以再吃一根冰棍外加一颗小豆冰，而且还可以又剩一分钱。十位数加减法因此学得精益求精。\n中学的时侯，渐渐不见了小豆冰。\n 冰棍儿还有各式各样的变体，可惜从此再没有小豆冰。\n雪糕统统摇身化作冰淇淋，奶油大雪糕和咖啡色的巧克力大雪糕一道肩并肩淹没在花样翻新的冰淇淋身后，也失去踪影。\n 回老家时，发现小店里有卖奶油雪糕的，透明油纸裹着，素面长方体，中间插着根棍儿，经典的雪糕模样。拿起一根咬一口，松软香浓，是正宗的奶油雪糕，久违的奶油雪糕。\n 在这改天换地的时代，至少有一样东西的味道没有变。",
    postId: 1,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100001Dc80Z3qPj2Z.m4a?fromtag=38",
      title: "罗大佑 恋曲1980",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003cWU1M2qNwxZ.jpg?max_age=2592000",
    },
    collectionStatus: true,
    upStatus: false,
    upNum: 11,
    comments: []
  },
  {
    date: "Jan 9 2017",
    title: "从童年呼啸而过的火车",
    postImg: "/images/post/post-5.jpg",
    avatar: "/images/avatar/avatar-1.png",
    content: "小时候，家的后面有一条铁路。听说从南方北上的火车都必须经过这条铁路。火车大多在晚上经过，但也不定是只有在夜深人静的时候，火车的声音才能从远方传来...",
    readingNum: 96,
    collectionNum: 7,
    commentNum: 4,
    author: "林白衣",
    dateTime: "24小时前",
    detail: "小时候，家的后面有一条铁路。听说从南方北上的火车都必须经过这条铁路。火车大多在晚上经过，可呜呜的汽笛声，往往却被淹没在傍晚小院儿里散步的人群声中。只有在夜深人静的时候，火车的声音才能清晰的从远处飘过来。虽然日日听见火车的汽笛声，可说也奇怪，我竟从来不知道铁路在哪里。在每个夏日午后，我都会有一种去找寻找铁路的冲动，去看看这条铁路究竟是从哪里来，又将通向哪里去\n一条铁路从我们村子中间穿过，一列列火车在村北的小站停靠过。二哥说他看过铁路通车剪彩，还说我们家里住过筑路的民工。我记事时，铁路就在那儿了，小站就在那儿了。望不到尽头的铁路是悠长的思量，飞奔的火车带走希望和梦想，火车就这样与童年的记忆密不可分。\n记得我上一年级时是在村北的一个空院子里，不是在大队部的村小学。我们村子大，也算是辖区划分，就近就读。一至三生产队的一年级小孩都集中在那里，只有我们一个班，老师随和腼腆，不怎么管我们，每天除了上几节课，就是打闹、疯玩、看火车。上课的院子距离铁路不过百米，倘若用心，每天过几列火车都是可以知道的。\n火车呼啸而过、地动山摇的气势常常使一帮小孩感到很震撼，近距离体验这种震撼是一件冒险和刺激的事情。我们上下学要从一个小小的铁路桥下穿过。桥下接近顶部的两边各有一块挑出的钢筋混凝土预制板（至今不知作何用途，检修桥墩的工作平台？），板侧还加有护栏。我们常常爬到上面去，听火车轰鸣着从头顶上方滚过，我们捂着耳朵大笑。我们当中最胆大的是六梅，她大我两岁，是个孩子王。想那时做过的不太乖，令爸爸很恼火的事大概都是跟着她干的。有一次，眼看见黑色的火车头冒着白烟远远开过来，她飞身跑到了桥面上，我大惊，她说没事。火车从她近前疾驰而过，带来的巨大的风将她的头发衣服吹起，她双手紧紧拉住桥上栏杆，昂着头，身体向一侧微微倾斜，摆一个英雄壮举的Pose，很酷的样子。（此节有悖安全教育）\n说说第一次坐火车。那年夏天下暴雨，妈妈去镇上卫生院上班的路给冲毁了。平时她去上班总是沿着大渠的堤坝步行，也就五六里的路程。因为下雨，渠水漫延，雨停了，仍有积水淤泥，不能走。于是决定坐火车，带上我，让我也坐坐火车。大哥去送我们，我们走到车站，小站很干净，露天站台上整齐地分布着几棵水滴造型的松树。我们站在月台中间等，我不时伸长脖子向远处张望，心情有点激动，天天看火车，还没坐过火车呢，那么多车厢，哪一节开门呢？火车开过来了，一节节车厢从眼前过去，终于慢慢停下来，可是没有哪一节车厢的门打开。正在紧张疑惑，发现前面几乎要驶出月台的一节车厢开门了。大哥拉起我就开始跑，他跑得太快了，我感觉我已经飞起来了。我现在怀疑他是否爆发出了博尔特的速度。他拉着我脚不沾地把我送进了车厢，妈妈也上了车，火车开了。沉浸在追车的紧张气氛中，气还没有喘匀，已经到站了。从我家到车站走了一公里，坐火车坐了3公里。后来在北京乘地铁，常想哪两站之间的距离有这么短呢？\n火车的长声嘶鸣，车轮碾过铁轨的哐吃声，白色的蒸汽沉重的吞吐声，风驰电掣呼啸而过的震撼，追车的紧张刺激，童年的火车总是令人着迷。后来看到铁凝的小说《哦，香雪》，觉得很美，小姑娘香雪在火车短暂停留的一分钟还可以卖东西给车上旅客。不过我第一次乘坐的好像是闷罐车，因为我没有印象有打开的车窗。\n 没有火车时的铁路，安静的像一幅几何图形。晴日里，铁轨发出耀眼的光芒向远方伸展开去。我会张开双臂小心翼翼地走在铁轨上，走着走玩着就到了我大姨家，大姨家有四个表姐，跟她们玩得不亦乐乎，就忘了回家。大姨家有一个砖券的窑洞，冬天很暖和，喜欢大姨家的窑洞，天晚了，吃了饭就不走了。爸爸找来了，看到我都钻到被窝了，放心了，就自己回去了。\n前不久，二哥还专门回去看看小站，沿铁路走走，拍了照片。高速铁路的发展，客车已经很少走这条线了，小站也没有了。童年的火车已经驶向了远方。",
    postId: 2,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100004VybKS2SpZVL.m4a?fromtag=38",
      title: "齐秦 原来的我",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003ZvAeK2PgA4Y.jpg?max_age=2592000"
    },
    collectionStatus: true,
    upStatus: true,
    upNum: 22,
    comments: [
      {
        username: '青石',
        avatar: '/images/avatar/avatar-3.png',
        create_time: '1484723344',
        content: {
          txt: ' 那一年的毕业季，我们挥挥手，来不及说再见，就踏上了远行的火车。',
          img: ["/images/comment/train-1.jpg", "/images/comment/train-2.jpg", "/images/comment/train-3.jpg"],
          audio: null
        }
      }, {
        username: '水清',
        avatar: '/images/avatar/avatar-2.png',
        create_time: '1481018319',
        content: {
          txt: '夏日的蝉鸣与夜晚的火车，时长会在未来无数的日子里不断的在我耳边响起，难以忘怀',
          img: [],
          audio: null,
        }
      },
      {
        username: '赤墨',
        avatar: '/images/avatar/avatar-1.png',
        create_time: '1484496000',
        content: {
          txt: '时光的湮染，自然的吞噬，让太多的老火车站也消失得无影无踪',
          img: ["/images/comment/train-4.jpg",],
          audio: null,
        }
      },
      {
        username: '林白',
        avatar: '/images/avatar/avatar-4.png',
        create_time: '1484582400',
        content: {
          txt: '',
          img: [],
          audio: { url: "http://123", timeLen: 8 },
        }
      }
    ]
  },
  {
    date: "Jan 29 2017",
    title: "记忆里的春节",
    postImg: "/images/post/post-1.jpg",
    avatar: "/images/avatar/avatar-3.png",
    content: "年少时，有几样东西，是春节里必不可少的：烟花、新衣、凉菜、压岁钱、饺子。年分大小年，有的地方是腊月二十三过小年，而有的地方是腊月二十四...",
    readingNum: 56,
    collectionNum: 6,
    commentNum: 0,
    author: "林白衣",
    dateTime: "24小时前",
    detail: "年少时，有几样东西，是春节里必不可少的：烟花、新衣、凉菜、压岁钱、饺子。年分大小年，有的地方是腊月二十三过小年，而有的地方是腊月二十四。童年的春节都是在小县城里度过，那时候的冬天还很冷，池塘的水会结冰，房屋上总是倒挂着一条条的冰棱，菜地里的白菜被厚厚的积雪覆盖着，只露出一小撮白绿相间的菜头，而茎部，竟然像是没有了一般...",
    postId: 3,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003XYcCu3IZKLc.m4a?fromtag=38",
      title: "老狼 虎口脱险",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002sNbWp3royJG.jpg?max_age=2592000"
    },
    collectionStatus: false,
    upStatus: false,
    upNum: 9,
    comments: []
  },
  {
    date: "Sep 22 2016",
    title: "换个角度，再来看看微信小程序的开发与发展",
    postImg: "/images/post/post-2.jpg",
    avatar: "/images/avatar/avatar-2.png",
    content: "前段时间看完了雨果奖中短篇获奖小说《北京折叠》。很有意思的是，张小龙最近也要把应用折叠到微信里，这些应用被他称为：小程序...",
    readingNum: 0,
    collectionNum: 0,
    commentNum: 0,
    author: "林白衣",
    dateTime: "24小时前",
    detail: "我们先举个例子来直观感受下小程序和APP有什么不同。大家都用过支付宝，在其内部包含着很多小的服务：手机充值、城市服务、生活缴费、信用卡还款、加油服务，吧啦吧啦一大堆服务。这些细小的、功能单一的服务放在支付宝这个超级App里，你并不觉得有什么问题，而且用起来也很方便。那如果这些小的应用都单独拿出来，成为一个独立的App",
    postId: 4,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100003z8cOo0Bs7zP.m4a?fromtag=38",
      title: "吴奇隆 祝你一路顺风",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000000n6a7p2HIPqU.jpg?max_age=2592000"
    },
    collectionStatus: false,
    upStatus: true,
    upNum: 9,
    comments: []
  },
  {
    date: "Jan 29 2017",
    title: "2017 微信公开课Pro",
    postImg: "/images/post/post-3.jpg",
    avatar: "/images/avatar/avatar-4.png",
    content: "在今天举行的2017微信公开课PRO版上，微信事业群总裁张小龙宣布，微信“小程序”将于1月9日正式上线。",
    readingNum: 32,
    collectionNum: 2,
    commentNum: 0,
    author: "林白衣",
    dateTime: "24小时前",
    detail: "在今天举行的2017微信公开课PRO版上，微信宣布，微信“小程序”将于1月9日正式上线，公布了几乎完整的小程序生态模式：微信里没有小程序入口、没有应用市场，分发模式几乎沿用公众号的模式，去中心化，限制搜索的能力，大多数小程序不能支持模糊搜索，必须输入完整的小程序名称...",
    postId: 5,
    music: {
      url: "http://ws.stream.qqmusic.qq.com/C100004K7D5E2xhv9v.m4a?fromtag=38",
      title: "杨千嬅 再见二丁目(live)",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000000ptb8p0ZIxDP.jpg?max_age=2592000",
    },
    collectionStatus: false,
    upStatus: false,
    upNum: 2,
    comments: []
  },
]

// module.exports = {
//   postList: postList
// }
export{postList}